--------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Admin\Desktop\Desktop\data\data\StataRegression\StataReg3.
> log
  log type:  text
 opened on:  31 Jul 2021, 09:27:20

. 
. use "bank_cha.dta", clear

. merge m:1 security_num using "security_location.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             1,215  (_merge==3)
    -----------------------------------------

. drop _merge

. merge m:1 year using "macro_cleaned.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             1,215  (_merge==3)
    -----------------------------------------

. drop _merge

. merge m:1  year 城市 using "cleaned_mkt_sum.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                           350
        from master                         9  (_merge==1)
        from using                        341  (_merge==2)

    matched                             1,206  (_merge==3)
    -----------------------------------------

. drop _merge

. *merge m:1 城市 year using "cleaned_provincial_unemployment.dta"
. *drop _merge
. merge m:1 year 城市 using "employ_shock.dta"
(note: variable 城市 was str9, now str11 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                           359
        from master                       359  (_merge==1)
        from using                          0  (_merge==2)

    matched                             1,197  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. 
. drop if year>2016 | year<2008 
(341 observations deleted)

. gen de_security_num = substr(security_num,-10,.)

. destring de_security_num, replace
de_security_num: all characters numeric; replaced as long

. save "regression_panel.dta", replace
file regression_panel.dta saved

. use "regression_panel.dta", clear

. drop if roae == "NA"
(34 observations deleted)

. drop if roaa == "NA"
(180 observations deleted)

. *drop if asset == "NA"
. *drop if equity == "NA"
. drop if diversification == "NA"
(0 observations deleted)

. 
. destring roaa, replace
roaa: all characters numeric; replaced as double

. destring roae, replace
roae: all characters numeric; replaced as double
(6 missing values generated)

. destring asset, replace
asset already numeric; no replace

. gen logasset = log(asset)
(120 missing values generated)

. destring equity, replace
equity already numeric; no replace

. destring diversification, replace
diversification: all characters numeric; replaced as double
(12 missing values generated)

. 
. gen lever = asset/equity
(121 missing values generated)

. *gen mkt_unemploy = mktization*unemploy_rate
. 
. winsor2 roaa , replace cuts (1 99)

. winsor2 roae , replace cuts (1 99)

. winsor2 lever , replace cuts (1 99)

. winsor2 diversification , replace cuts (1 99)

. 
. gen logasset_mkt = logasset*mktization
(126 missing values generated)

. gen lever_mkt = lever*mktization
(127 missing values generated)

. 
. gen logasset_employshock = logasset*employ_shock
(128 missing values generated)

. gen lever_employshock = lever*employ_shock
(129 missing values generated)

. 
. //roae
.  
. //OLS
. reg roae lever logasset diversification mktization employ_shock i.year i.de_se
> curity_num, cluster(城市)

Linear regression                               Number of obs     =        862
                                                F(12, 29)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.6453
                                                Root MSE          =     4.7703

                                   (Std. Err. adjusted for 30 clusters in 城市)
-------------------------------------------------------------------------------
              |               Robust
         roae |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
        lever |   .5516348   .1263508     4.37   0.000     .2932183    .8100513
     logasset |   .6045024   1.627055     0.37   0.713    -2.723198    3.932203
diversifica~n |  -.0304212    .018967    -1.60   0.120    -.0692131    .0083708
   mktization |  -.2215172   .9796171    -0.23   0.823    -2.225059    1.782025
 employ_shock |  -17.11745   18.45213    -0.93   0.361    -54.85631     20.6214
              |
         year |
        2009  |  -2.831767   .8929236    -3.17   0.004    -4.658001   -1.005534
        2010  |   -1.20034    1.43385    -0.84   0.409    -4.132892    1.732212
        2011  |     .75335   2.320116     0.32   0.748     -3.99182     5.49852
        2012  |  -1.345268   2.369986    -0.57   0.575    -6.192433    3.501897
        2013  |  -.4782699   4.171019    -0.11   0.910    -9.008961    8.052421
        2014  |  -4.241931   2.797279    -1.52   0.140    -9.963008    1.479147
        2015  |  -7.316066   2.873644    -2.55   0.016    -13.19333   -1.438804
        2016  |  -8.149493   3.170047    -2.57   0.016    -14.63297   -1.666019
              |
de_security~m |
      100217  |   6.113181   2.006223     3.05   0.005     2.009995    10.21637
      100218  |  -.6194291   2.701086    -0.23   0.820     -6.14377    4.904912
      100219  |   2.717115   .6547824     4.15   0.000     1.377935    4.056295
      100222  |   1.368042   .8124317     1.68   0.103    -.2935674    3.029651
      100224  |  -1.229239   3.059351    -0.40   0.691    -7.486315    5.027837
      100225  |  -2.397829   3.269573    -0.73   0.469    -9.084855    4.289198
      100226  |  -1.447892   2.546558    -0.57   0.574    -6.656187    3.760404
      100227  |  -3.467908   1.817832    -1.91   0.066    -7.185792    .2499756
      100228  |  -1.877798   3.135556    -0.60   0.554    -8.290731    4.535135
      100229  |  -.4597785   2.630601    -0.17   0.862    -5.839962    4.920405
      200004  |  -4.026656   1.066373    -3.78   0.001    -6.207634   -1.845679
      200005  |  -5.786173   1.040448    -5.56   0.000    -7.914128   -3.658217
      200007  |  -3.565237   3.654027    -0.98   0.337    -11.03856    3.908088
      200014  |   8.622615   3.585486     2.40   0.023     1.289472    15.95576
      200015  |  -2.945902   2.143792    -1.37   0.180    -7.330448    1.438644
      200016  |  -7.156267   2.956118    -2.42   0.022    -13.20221   -1.110327
      200018  |    .499647   2.503285     0.20   0.843    -4.620147    5.619441
      200019  |  -1.610261   2.776527    -0.58   0.566    -7.288897    4.068374
      200020  |   3.075812   2.767831     1.11   0.276    -2.585039    8.736663
      200021  |  -4.438537    1.59115    -2.79   0.009    -7.692803    -1.18427
      200024  |   5.594877   3.251183     1.72   0.096    -1.054538    12.24429
      200025  |  -2.979797   .7465582    -3.99   0.000     -4.50668   -1.452914
      200026  |  -.6292558   3.405925    -0.18   0.855    -7.595155    6.336644
      200035  |  -4.680622   .5696592    -8.22   0.000    -5.845706   -3.515538
      200036  |  -2.495216   2.258827    -1.10   0.278    -7.115035    2.124603
      200038  |   5.265791   1.638338     3.21   0.003     1.915014    8.616568
      200045  |  -4.645054   2.206747    -2.10   0.044    -9.158358   -.1317487
      200049  |   -1.41727   1.919792    -0.74   0.466    -5.343686    2.509146
      200051  |  -.3212057   4.215932    -0.08   0.940    -8.943755    8.301344
      200056  |   14.77562   3.230547     4.57   0.000     8.168413    21.38284
      200058  |   1.001798   1.947568     0.51   0.611    -2.981427    4.985022
      200059  |   2.606119   1.391715     1.87   0.071    -.2402588    5.452497
      200060  |   4.769102    .976813     4.88   0.000     2.771295    6.766909
      200061  |   2.405779   1.093224     2.20   0.036     .1698841    4.641674
      200063  |   .8733989   1.939692     0.45   0.656    -3.093716    4.840514
      200068  |  -4.645643   3.565673    -1.30   0.203    -11.93826    2.646978
      200071  |  -1.076441   2.693058    -0.40   0.692    -6.584362     4.43148
      200072  |  -1.803238   2.576123    -0.70   0.490    -7.072001    3.465526
      200073  |   -2.37015   4.304811    -0.55   0.586    -11.17448    6.434178
      200074  |  -.1258693   2.352411    -0.05   0.958     -4.93709    4.685352
      200075  |   3.946706   3.269617     1.21   0.237    -2.740412    10.63382
      200076  |   8.827201   3.644135     2.42   0.022     1.374108    16.28029
      200077  |   13.31776   3.186903     4.18   0.000     6.799814    19.83571
      200078  |    .838022   3.721265     0.23   0.823    -6.772819    8.448863
      200081  |  -11.76773    3.83886    -3.07   0.005    -19.61908   -3.916383
      200102  |  -.3575259   1.417871    -0.25   0.803    -3.257398    2.542346
      200104  |   3.009974   2.401233     1.25   0.220    -1.901099    7.921047
      200105  |  -.2204082   3.012422    -0.07   0.942    -6.381502    5.940686
      200120  |  -1.195773   3.601225    -0.33   0.742    -8.561105    6.169559
      200130  |  -5.076183   2.479114    -2.05   0.050    -10.14654   -.0058258
      200146  |  -2.169331   1.593421    -1.36   0.184    -5.428242    1.089581
      200147  |    1.45566   4.262012     0.34   0.735    -7.261134    10.17245
      200148  |    9.92677   3.790248     2.62   0.014     2.174842     17.6787
      200153  |   2.573863   3.065083     0.84   0.408    -3.694935    8.842661
      200176  |  -4.329111   3.351739    -1.29   0.207    -11.18419    2.525964
      200186  |  -5.172055   2.731334    -1.89   0.068    -10.75826    .4141502
      200204  |  -3.151811   3.128002    -1.01   0.322    -9.549294    3.245671
      200206  |   10.91309    4.05329     2.69   0.012     2.623182      19.203
      200214  |  -4.312467   4.223845    -1.02   0.316     -12.9512    4.326266
      200215  |   1.816844   3.132635     0.58   0.566    -4.590114    8.223803
      200216  |  -2.013018   2.136576    -0.94   0.354    -6.382806    2.356771
      200217  |   3.224131   3.784539     0.85   0.401     -4.51612    10.96438
      200219  |    .460044   2.339139     0.20   0.845    -4.324032     5.24412
      200227  |  -2.263995   1.973192    -1.15   0.261    -6.299625    1.771636
      200231  |   6.285208   3.159288     1.99   0.056    -.1762615    12.74668
      200238  |    1.45073   2.095882     0.69   0.494    -2.835831    5.737291
      200260  |  -6.039362    2.76352    -2.19   0.037    -11.69139   -.3873295
      200264  |   .3335916   5.139643     0.06   0.949    -10.17816    10.84534
      200269  |   -3.29328   3.232523    -1.02   0.317    -9.904533    3.317973
      200270  |   2.944998   3.322942     0.89   0.383    -3.851182    9.741178
      200271  |  -6.930459    2.66713    -2.60   0.015    -12.38535   -1.475566
      200273  |   1.247863   3.064103     0.41   0.687    -5.018931    7.514657
      200274  |  -6.583909   2.207148    -2.98   0.006    -11.09803   -2.069784
      200275  |   7.623732   2.388879     3.19   0.003     2.737926    12.50954
      200293  |   2.335751   2.759735     0.85   0.404     -3.30854    7.980042
      200294  |  -1.276434   2.686627    -0.48   0.638    -6.771203    4.218335
      200314  |  -4.521254   3.361872    -1.34   0.189    -11.39705    2.354545
      200318  |   3.647317   3.207134     1.14   0.265    -2.912009    10.20664
      200320  |   2.260893   6.404747     0.35   0.727    -10.83829    15.36007
      200321  |   4.196124   3.864097     1.09   0.286    -3.706842    12.09909
      200322  |   1.979542   3.598288     0.55   0.586    -5.379783    9.338867
      200323  |   6.464797   2.572574     2.51   0.018     1.203293     11.7263
      200324  |   .4866601   3.420702     0.14   0.888     -6.50946    7.482781
      200325  |   3.441687   4.155427     0.83   0.414    -5.057115    11.94049
      200326  |  -2.986705   5.046264    -0.59   0.559    -13.30747    7.334064
      200327  |   2.470679    3.16655     0.78   0.442    -4.005643    8.947001
      200332  |   3.124644   3.879991     0.81   0.427    -4.810829    11.06012
      200335  |  -9.015042   1.930262    -4.67   0.000    -12.96287   -5.067213
      200336  |  -2.733537   1.987595    -1.38   0.180    -6.798625    1.331551
      200340  |   3.540818   2.563017     1.38   0.178    -1.701141    8.782777
      200341  |   2.304295   5.608479     0.41   0.684    -9.166334    13.77492
      200342  |   3.149092   4.219535     0.75   0.461    -5.480826    11.77901
      200343  |   9.920361   3.980967     2.49   0.019     1.778369    18.06235
      200345  |   4.166608   4.213212     0.99   0.331    -4.450379     12.7836
      200346  |   3.865589    4.15972     0.93   0.360    -4.641993    12.37317
      200347  |  -.3150373   4.528532    -0.07   0.945    -9.576925     8.94685
      200348  |  -.3019152   4.385714    -0.07   0.946    -9.271708    8.667877
      200375  |  -6.126718   1.204661    -5.09   0.000    -8.590527    -3.66291
      200414  |  -.6095497   4.846379    -0.13   0.901    -10.52151    9.302408
      200416  |  -5.304716   4.623513    -1.15   0.261    -14.76086     4.15143
      200443  |   .5086275   2.741802     0.19   0.854    -5.098987    6.116242
      200446  |  -3.078919   3.211039    -0.96   0.346    -9.646231    3.488393
      200451  |   6.442205   2.545259     2.53   0.017     1.236566    11.64784
      200495  |   .5934204   2.521919     0.24   0.816    -4.564482    5.751323
      200496  |   1.056059   .6544954     1.61   0.117     -.282534    2.394653
      200557  |  -3.209874   3.605695    -0.89   0.381    -10.58435    4.164601
      200924  |  -10.56703   3.765216    -2.81   0.009    -18.26776   -2.866295
      200928  |  -1.455115   1.559848    -0.93   0.359    -4.645362    1.735132
      200930  |   -1.83763   1.259389    -1.46   0.155    -4.413369    .7381092
      200968  |   -8.14784   3.117608    -2.61   0.014    -14.52406   -1.771614
      201003  |   1.852741     4.5285     0.41   0.685    -7.409081    11.11456
      201010  |  -5.773387   5.327146    -1.08   0.287    -16.66862     5.12185
      201016  |  -2.636831   6.170018    -0.43   0.672    -15.25593    9.982272
      201027  |  -3.238637   2.613672    -1.24   0.225    -8.584196    2.106921
      201293  |    .893311   2.545672     0.35   0.728    -4.313173    6.099795
      201354  |  -11.88077    6.77479    -1.75   0.090    -25.73677    1.975229
      201355  |  -2.146516    .894389    -2.40   0.023    -3.975747    -.317285
      201710  |  -4.119437   5.070944    -0.81   0.423    -14.49068    6.251808
      203210  |   4.845626   .9051483     5.35   0.000      2.99439    6.696862
      203212  |  -4.219499   2.852501    -1.48   0.150    -10.05352    1.614521
              |
        _cons |  -.4621459   39.70536    -0.01   0.991    -81.66872    80.74443
-------------------------------------------------------------------------------

. outreg2 using Table1_1, excel dec(4) drop(_I* o._I* _I.de_security_num), repla
> ce
invalid 'replace' 
r(198);

end of do-file

r(198);

. do "C:\Users\Admin\AppData\Local\Temp\STD20e8_000000.tmp"

. generate province_num = 城市

. destring province_num, replace force
province_num: contains nonnumeric characters; replaced as byte
(1001 missing values generated)

. 
end of do-file

. sum province_num

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
province_num |          0

. edit

. do "C:\Users\Admin\AppData\Local\Temp\STD20e8_000000.tmp"

. reg roae lever logasset diversification mktization i.城市#year i.year i.de_sec
> urity_num, cluster(城市)
城市:  string variables may not be used as factor variables
r(109);

end of do-file

r(109);

. exit, clear
